aabzel/trunk/source/mcal/mcal_stm32f4/timer/timer_mcal.c
#include "timer_mcal.h"

#include <stddef.h>
#include <string.h>

#include "bit_utils.h"
#include "clock_custom_const.h"
#include "code_generator.h"
#include "data_utils.h"
#include "float_utils.h"
#include "hal_diag.h"
#include "hal_mcal.h"
#include "log.h"
#include "std_includes.h"
#include "stm32f4xx_hal.h"
#include "sys_config.h"
#include "timer_custom.h"
#ifdef HAS_CORE
#include "core_driver.h"
#endif

#ifdef HAS_CLOCK
#include "clock_mcal.h"
#endif

#ifdef HAS_SOFTWARE_TIMER
#include "software_timer_isr.h"
#endif /**/

#ifdef HAS_SYSTICK
#include "systick_mcal.h"
#endif

uint32_t TimerChannelToHalChannel(TimerCapComChannel_t channel) {
    uint32_t hal_channel = 0;
    switch(channel) {
    case 1:
        hal_channel = TIM_CHANNEL_1;
        break;
    case 2:
        hal_channel = TIM_CHANNEL_2;
        break;
    case 3:
        hal_channel = TIM_CHANNEL_3;
        break;
    case 4:
        hal_channel = TIM_CHANNEL_4;
        break;
    default:
        break;
    }
    return hal_channel;
}

#if 0
uint8_t timer_get_width(uint32_t timer_base) {
    uint8_t width = 0;
    return width;
}
#endif

static const int32_t Timer1IRQs[] = {TIM1_CC_IRQn, TIM1_TRG_COM_TIM11_IRQn, TIM1_UP_TIM10_IRQn, TIM1_BRK_TIM9_IRQn};

static const TimerInfo_t TimerInfo[] = {
#ifdef TIM1
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB2,
        .num = 1,
        .TIMx = TIM1,
        .irq_n = Timer1IRQs,
        .irq_cnt = ARRAY_SIZE(Timer1IRQs),
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
                .compare3 = 1,
                .compare4 = 1,
            },
    },
#endif

#ifdef TIM2
    {
        .bitness = 32,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 2,
        .TIMx = TIM2,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
                .compare3 = 1,
                .compare4 = 1,
            },
    },
#endif

#ifdef TIM3
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 3,
        .TIMx = TIM3,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
                .compare3 = 1,
                .compare4 = 1,
            },
    },
#endif

#ifdef TIM4
    {
        .valid = true,
        .bitness = 16,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 4,
        .TIMx = TIM4,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
                .compare3 = 1,
                .compare4 = 1,
            },
    },
#endif

#ifdef TIM5
    {
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 5,
        .bitness = 32,
        .TIMx = TIM5,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
                .compare3 = 1,
                .compare4 = 1,
            },
    },
#endif

#ifdef TIM6
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 6,
        .TIMx = TIM6,
        .Comparators =
            {
                .compare1 = 0,
                .compare2 = 0,
                .compare3 = 0,
                .compare4 = 0,
            },
    },
#endif

#ifdef TIM7
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 7,
        .TIMx = TIM7,
        .Comparators =
            {
                .compare1 = 0,
                .compare2 = 0,
                .compare3 = 0,
                .compare4 = 0,
            },
    },
#endif

#ifdef TIM8
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB2,
        .num = 8,
        .TIMx = TIM8,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
                .compare3 = 1,
                .compare4 = 1,
            },
        /*1 2 3 4   */
    },
#endif

#ifdef TIM9
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB2,
        .num = 9,
        .TIMx = TIM9,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
            },
        /*1 2*/
    },
#endif

#ifdef TIM10
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB2,
        .num = 10,
        .TIMx = TIM10,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
            },
    },
#endif

#ifdef TIM11
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB2,
        .num = 11,
        .TIMx = TIM11,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
            },
    },
#endif

#ifdef TIM12
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 12,
        .TIMx = TIM12,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
            },
    },
#endif

#ifdef TIM13
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 13,
        .TIMx = TIM13,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
            },
    },
#endif

#ifdef TIM14
    {
        .bitness = 16,
        .valid = true,
        .clock_bus = CLOCK_BUS_APB1,
        .num = 14,
        .TIMx = TIM14,
        .Comparators =
            {
                .compare1 = 1,
                .compare2 = 1,
            },
    },
#endif
};

static const TimerChannelInfo_t TimerChannelInfo[] = {
    {
        .timer_num = 9,
        .out_channel = 1,
        .Pad =
            {
                .port = PORT_E,
                .pin = 5,
            },
        .valid = true,
    },
    {
        .timer_num = 9,
        .out_channel = 2,
        .Pad =
            {
                .port = PORT_E,
                .pin = 6,
            },
        .valid = true,
    },
    {
        .timer_num = 10,
        .out_channel = 2,
        .Pad =
            {
                .port = PORT_F,
                .pin = 6,
            },
        .valid = true,
    },
    {
        .timer_num = 11,
        .out_channel = 1,
        .Pad =
            {
                .port = PORT_F,
                .pin = 7,
            },
        .valid = true,
    },
    {
        .timer_num = 13,
        .out_channel = 1,
        .Pad =
            {
                .port = PORT_F,
                .pin = 8,
            },
        .valid = true,
    },
};

TimerChannelInfo_t* TimerChannelGetNode(const uint8_t timer_num, const uint8_t channel) {
    uint32_t i = 0;
    TimerChannelInfo_t* ChannelInfo = NULL;
    uint32_t cnt = ARRAY_SIZE(TimerChannelInfo);
    for(i = 0; i < cnt; i++) {
        if(TimerChannelInfo[i].valid) {
            if(timer_num == TimerChannelInfo[i].timer_num) {
                if(channel == TimerChannelInfo[i].out_channel) {
                    ChannelInfo = &TimerChannelInfo[i];
                    break;
                }
            }
        }
    }
    return ChannelInfo;
}

