aabzel/trunk/source/mcal/mcal_stm32f4/timer/timer_mcal.c
uint32_t timer_mcu_cnt_get(void) {
    uint32_t cnt = ARRAY_SIZE(TimerInfo);
    return cnt;
}

TimerInfo_t* TimerGetInfo(const uint8_t num) {
    TimerInfo_t* Info = NULL;
    uint32_t i = 0;
    uint32_t cnt = ARRAY_SIZE(TimerInfo);
    for(i = 0; i < cnt; i++) {
        if(num == TimerInfo[i].num) {
            if(TimerInfo[i].valid) {
                Info = &TimerInfo[i];
                break;
            }
        }
    }
    return Info;
}
int8_t TimInstance2Num(const TIM_TypeDef* const TIMERx) {
    int8_t num = -1;
    uint32_t i = 0;
    uint32_t cnt = ARRAY_SIZE(TimerInfo);
    for(i = 0; i < cnt; i++) {
        if(TIMERx == TimerInfo[i].TIMx) {
            num = (int8_t)TimerInfo[i].num;
            break;
        }
    }
    return num;
}

TIM_TypeDef* timer_get_ptr(const uint8_t num) {
    TIM_TypeDef* TIMx = NULL;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        TIMx = Info->TIMx;
    }
    return TIMx;
}

uint8_t timer_bitness_get(uint8_t num) {
    uint8_t bitness = 0;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        bitness = Info->bitness;
    }
    return bitness;
}

uint32_t timer_period_get(uint8_t num) {
    uint32_t timer_period32 = 0;
    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        timer_period32 = TIMx->ARR;
    }
    return timer_period32;
}

#if 0
uint32_t timer_get_cc_val( uint8_t  num,   TimerCapComChannel_t chaneel  ){
	return 0;
}

bool timer_set_cc_val( uint8_t num, TimerCapComChannel_t channel,
		uint32_t cc_value, bool int_on){
	return false;
}


bool timer_set_status( uint8_t num,   bool on_off){
	return 0;
}

uint8_t timer_get_bitness(  uint8_t num){
	return 0;
}
double timer_get_tick_s(uint8_t  num){
	return 0.0;
}
#endif

ClockBus_t timer_clock_bus_name_get(const uint8_t num) {
    ClockBus_t clock_bus_name = CLOCK_BUS_UNDEF;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        clock_bus_name = Info->clock_bus;
    }
    return clock_bus_name;
}

int32_t timer_bus_clock_get(uint8_t num) {
    int32_t clock_hz = -1;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        uint32_t pclk = 0;
        switch(Info->clock_bus) {
        case CLOCK_BUS_APB1:
            pclk = HAL_RCC_GetPCLK1Freq();
            break;
        case CLOCK_BUS_APB2:
            pclk = HAL_RCC_GetPCLK2Freq();
            break;
        default:
            LOG_ERROR(TIMER, "NoBusClock");
            break;
        }
        clock_hz = 2 * pclk;
    }
    return clock_hz;
}

#if 0
bool timer_frequency_get(uint8_t num, double * const frequency){
//double timer_frequency_get(uint8_t num) {
    bool res = false ;
    double frequency_hz = 0.0;
    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        int32_t bus_clock = timer_bus_clock_get(num);
        frequency_hz = ((double)bus_clock) / (((double)TIMx->ARR + 1) * ((double)TIMx->PSC + 1));
        *frequency=frequency_hz;
        res = true;
    }
    return res;
}
#endif

bool timer_get_status(uint8_t num) {
    bool res = true;
    uint8_t status = 0xFF;
    uint32_t timer_cr1 = 0;
    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        res = true;
        timer_cr1 = TIMx->CR1;
    } else {
        res = false;
    }

    if(res) {
        status = MASK_1BIT & timer_cr1;
    }
    return status;
}

uint32_t timer_prescaler_get(uint8_t num) {
    bool res = true;
    uint32_t timer_prescaler = 0xFF;
    uint32_t timer_prescaler32 = 0;

    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        res = true;
        timer_prescaler32 = TIMx->PSC;
    } else {
        res = false;
    }

    if(res) {
        timer_prescaler = MASK_16BIT & timer_prescaler32;
    }
    return timer_prescaler;
}

uint32_t timer_get_auto_reload(uint8_t num) {
    uint32_t auto_reload = 0;
    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        auto_reload = TIMx->ARR;
    }

    return auto_reload;
}

uint32_t timer_counter_to_us(uint8_t num, uint32_t counter) {
    uint32_t up_time_us = counter;
    return up_time_us;
}

uint32_t timer_counter_get(uint8_t num) {
    uint32_t timer_cnt32 = 0;
    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        timer_cnt32 = TIMx->CNT;
    }

    return timer_cnt32;
}

bool timer_ctrl(uint8_t num, bool on_off) {
    bool res = false;
    TimerHandle_t* Node = TimerGetNode(num);
    if(Node) {
        HAL_StatusTypeDef ret = HAL_ERROR;
        if(on_off) {
            ret = HAL_TIM_Base_Start_IT(&Node->Handle);
            // ret = HAL_TIM_Base_Start(&Node->Handle);
            // HAL_StatusTypeDef HAL_TIM_Base_Start_IT(TIM_HandleTypeDef *htim);
        } else {
            ret = HAL_TIM_Base_Stop_IT(&Node->Handle);
            // ret = HAL_TIM_Base_Stop(&Node->Handle);
        }
        res = HAL_retToRes(ret);
    }
    return res;
}

bool timer_channel_ctrl(uint8_t num, TimerCapComChannel_t channel, bool on_off) {
    bool res = false;
    TimerHandle_t* Node = TimerGetNode(num);
    if(Node) {
        res = timer_is_valid_channel(num, channel);
        if(res) {
            res = false;
#ifdef HAS_HAL_TIM_PWM
            uint32_t hal_channel = TimerChannelToHalChannel(channel);

            res = HAL_TIM_CHANNEL_STATE_READY == TIM_CHANNEL_STATE_GET(&Node->Handle, hal_channel);
            if(res) {
                HAL_StatusTypeDef ret = HAL_ERROR;
                if(on_off) {
                    ret = HAL_TIM_PWM_Start_IT(&Node->Handle, hal_channel);
                } else {
                    ret = HAL_TIM_PWM_Stop_IT(&Node->Handle, hal_channel);
                }
                res = HAL_retToRes(ret);
                if(!res) {
#ifdef HAS_HAL_DIAG
                    LOG_ERROR(TIMER, "%u=%s", ret, HalStatusToStr(ret));
#endif
                }
            } else {
                res = true;
            }
#endif
        }
    }
    return res;
}

bool timer_period_set_ll(TimerHandle_t* const Node, const uint32_t period) {
    bool res = false;
    if(Node) {
        /*auto-reload register*/
        Node->Handle.Instance->ARR = period;
        res = true;
    }
    return res;
}

