aabzel/trunk/source/mcal/mcal_stm32f4/timer/timer_mcal.c
bool timer_period_set(uint8_t num, uint32_t period) {
    bool res = false;
    TimerHandle_t* Node = TimerGetNode(num);
    if(Node) {
        res = timer_period_set_ll(Node, period);
    }
    return res;
}

#if 0
uint64_t timer_period_get_us(uint8_t num) {
    uint64_t real_period_us = 0;
    uint32_t prescaler = 0;
    uint32_t reload = 0;
    TimerHandle_t* Node = NULL;
    Node = TimerGetNode(num);
    if(Node) {
        double fck = (double)timer_bus_clock_get(num);
        double tf = 1.0 / fck;
        prescaler = Node->Handle.Instance->PSC;
        reload = Node->Handle.Instance->ARR;
        double t_psc = tf * ((double)prescaler);

        real_period_us = (uint64_t)(t_psc * ((double)reload)) * 1000000.0;
    }
    return real_period_us;
}

double timer_period_get_s(uint8_t num) {
    double real_period_s = 0;
    uint32_t prescaler = 0;
    uint32_t reload = 0;
    TimerHandle_t* Node = NULL;
    Node = TimerGetNode(num);
    if(Node) {
        double fck = (double)timer_bus_clock_get(num);
        double tf = 1.0 / fck;
        prescaler = Node->Handle.Instance->PSC;
        reload = Node->Handle.Instance->ARR;
        double t_psc = tf * ((double)prescaler);

        real_period_s = (t_psc * ((double)reload));
    }
    return real_period_s;
}

uint64_t timer_get_us(uint8_t num) {
    uint64_t up_time_us = 0, int_cnt = 0, cnt_us = 0;
    uint64_t period_us = MSEC_2_USEC(TIMER_US_PERIOD_MS);
    TimerHandle_t* Node = NULL;
    Node = TimerGetNode(num);
    if(Node) {
        int_cnt = Node->int_cnt;
        cnt_us = __HAL_TIM_GET_COUNTER(&(Node->Handle));
        up_time_us = cnt_us + int_cnt * period_us;
    }
    return up_time_us;
}

uint32_t timer_get_ms(uint8_t num) {
    uint32_t up_time_ms = 0;
    //uint32_t int_cnt = 0, cnt_ms = 0;
    TimerHandle_t* Node = NULL;
#ifdef TIMER_MS_TICK_NUM
    Node = TimerGetNode(num);
#endif /*TIM2*/

    if(Node) {
        //cnt_ms = __HAL_TIM_GET_COUNTER(&(Node->Handle))/2;
        //int_cnt = Node->int_cnt;
        //up_time_ms = cnt_ms + TIMER_MS_PERIOD_MS * (int_cnt/2);

        up_time_ms =  Node->int_cnt;
    }

    return up_time_ms;
}

#endif
TimerDir_t timer_dir_get(uint8_t num) {
    TimerDir_t dir = TIMER_CNT_DIR_UNDEF;
    TIM_TypeDef* TIMx = timer_get_ptr(num);
    if(TIMx) {
        uint32_t timer_cr1 = 0;
        timer_cr1 = TIMx->CR1;
        if(BIT_4 == (BIT_4 & timer_cr1)) {
            dir = TIMER_CNT_DIR_DOWN;
        } else {
            dir = TIMER_CNT_DIR_UP;
        }
    }
    return dir;
}

bool timer_out_channel_pad_get(uint8_t num, TimerCapComChannel_t channel, Pad_t* const Pad) {
    bool res = false;
    TimerChannelInfo_t* Channel = TimerChannelGetNode(num, channel);
    if(Channel) {
        *Pad = Channel->Pad;
        res = true;
    }
    return res;
}

bool timer_is_valid_channel(const uint8_t num, const uint8_t channel) {
    bool res = false;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        uint8_t comparator_mask = (1U << channel);
        if(comparator_mask == (comparator_mask & Info->Comparators.byte)) {
            res = true;
        } else {
            res = false;
        }
    }
    return res;
}

bool timer_counter_set(uint8_t num, uint32_t value) {
    bool res = false;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        Info->TIMx->CNT = value;
        res = true;
    }
    return res;
}

bool timer_compare_set(uint8_t num, TimerCapComChannel_t channel, uint32_t compare_value) {
    bool res = false;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        res = timer_is_valid_channel(num, channel);
        if(res) {
            switch(channel) {
            case TIMER_CC_CHAN_1: {
                Info->TIMx->CCR1 = compare_value;
                res = true;
            } break;
            case TIMER_CC_CHAN_2: {
                Info->TIMx->CCR2 = compare_value;
                res = true;
            } break;
            case TIMER_CC_CHAN_3: {
                Info->TIMx->CCR3 = compare_value;
                res = true;
            } break;
            case TIMER_CC_CHAN_4: {
                Info->TIMx->CCR4 = compare_value;
                res = true;
            } break;
            default:
                res = false;
                break;
            }
        }
    }
    return res;
}

uint32_t timer_cc_val_get(const uint8_t num, const TimerCapComChannel_t channel) {
    uint32_t cap_com_val = 0;
    TimerInfo_t* Info = TimerGetInfo(num);
    if(Info) {
        if(Info->TIMx) {
            switch(channel) {
            case TIMER_CC_CHAN_1: {
                cap_com_val = Info->TIMx->CCR1;
            } break;
            case TIMER_CC_CHAN_2: {
                cap_com_val = Info->TIMx->CCR2;
            } break;
            case TIMER_CC_CHAN_3: {
                cap_com_val = Info->TIMx->CCR3;
            } break;
            case TIMER_CC_CHAN_4: {
                cap_com_val = Info->TIMx->CCR4;
            } break;
            default:
                cap_com_val = 0;
                break;
            }
        }
    }
    return cap_com_val;
}

uint32_t timer_ccc_val_get(uint8_t num, TimerCapComChannel_t channel) {
    uint32_t ccc_val = timer_cc_val_get(num, channel);
    return ccc_val;
}

static bool timer_config_to_init(uint32_t prescaler, uint32_t out_load, TIM_Base_InitTypeDef* const Init) {
    bool res = false;
    if(Init) {
        if(out_load) {
            Init->RepetitionCounter = 0;
            Init->Prescaler = prescaler;
            Init->CounterMode = TIM_COUNTERMODE_UP;
            Init->Period = out_load;
            Init->ClockDivision = TIM_CLOCKDIVISION_DIV1;
            Init->AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
            res = true;
        }
    }
    return res;
}

static bool timer_init_interrupts_ll(TimerInfo_t* Info) {
    bool res = false;
    if(Info->irq_cnt) {
        if(Info->irq_n) {
            uint32_t i = 0;
            for(i = 0; i < Info->irq_cnt; i++) {
                HAL_NVIC_SetPriority(Info->irq_n[i], 15, 15);
                HAL_NVIC_EnableIRQ(Info->irq_n[i]);
            }
            res = true;
        }
    }
    return res;
}

