aabzel/trunk/source/mcal/mcal_stm32f4/timer/timer_mcal.c
static bool timer_errata_fix(TimerHandle_t* const Node) {
    bool res = false;
    /* prevent timer interrupt at timer start */
    Node->Handle.Instance->EGR |= TIM_EGR_UG;
    __NOP();
    __NOP();
    __NOP();
    Node->Handle.Instance->SR = 0; //&= ~TIM_FLAG_UPDATE;

    return res;
}

bool timer_init_one(uint8_t num) {
    bool res = false;
#ifdef HAS_LOG
    LOG_WARNING(TIMER, "%u Init", num);
#endif
    TimerHandle_t* Node = TimerGetNode(num);
    const TimerConfig_t* Config = TimerGetConfig(num);
    TimerInfo_t* Info = TimerGetInfo(num);

    if(Info) {
#ifdef HAS_TIMER_DIAG
        LOG_WARNING(TIMER, "%s", TimerInfoToStr(Info));
#endif
        if(Config) {
#ifdef HAS_TIMER_DIAG
            LOG_WARNING(TIMER, "%s", TimerConfigToStr(Config));
#endif
            res = TimerIsValidConfig(Config);
            if(res) {
                if(Node) {
                    Node->TIMx = Info->TIMx;
                    res = true;
                }
            }
        }
    }

    if(res) {
        uint32_t out_load = 0;

        uint32_t prescaler = 0;

        uint32_t bus_clock_hz = 0;
        bus_clock_hz = timer_bus_clock_get(num);
        prescaler = timer_calc_prescaler((uint32_t)bus_clock_hz, Config->cnt_period_ns, TIMER_PRESCALER_MAX)-1;
        res = timer_calc_registers(Config->period_s, bus_clock_hz, prescaler, &out_load, 0xFFFFFFFF);
        if(res) {
            // HAL_TIM_IRQHandler(&Node->Handle);

            TIM_MasterConfigTypeDef sMasterConfig = {0};
            TIM_ClockConfigTypeDef sClockSourceConfig = {0};

            if(Info->TIMx) {
                if(Config->interrupt_on) {
                    res = timer_init_interrupts_ll(Info);
                }

                Node->int_cnt = 0;
                Node->Handle.Instance = Info->TIMx;
                res = timer_config_to_init(prescaler, out_load, &Node->Handle.Init);
                res = timer_base_clock_ctrl(num, true);

                if(HAL_OK == HAL_TIM_Base_Init(&Node->Handle)) {
                    res = true;
#ifdef HAS_LOG
                    LOG_INFO(TIMER, "%u InitOk", num);
#endif
                }

                sClockSourceConfig.ClockFilter = 0;
                sClockSourceConfig.ClockPrescaler = TIM_CLOCKPRESCALER_DIV1;
                sClockSourceConfig.ClockPolarity = TIM_CLOCKPOLARITY_RISING;
                sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
                if(HAL_TIM_ConfigClockSource(&Node->Handle, &sClockSourceConfig) != HAL_OK) {
                    res = false;
#ifdef HAS_LOG
                    LOG_ERROR(TIMER, "%u SetClkSrcErr", num);
#endif
                }

                sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
                sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
                if(HAL_TIMEx_MasterConfigSynchronization(&Node->Handle, &sMasterConfig) != HAL_OK) {
                    res = false;
#ifdef HAS_LOG
                    LOG_ERROR(TIMER, "%u SetSyncErr", num);
#endif
                }

                res = timer_errata_fix(Node);

                res = timer_ctrl(num, Config->on_off);
            } else {
                res = false;
            }
        } else {
#ifdef HAS_LOG
            LOG_ERROR(TIMER, "CalcPscLdErr");
#endif
        }
    }

    return res;
}

static bool timer_base_clock_on(const uint8_t num) {
    bool res = false;
    switch(num) {
    case 1: {
        __HAL_RCC_TIM1_CLK_DISABLE();
        res = true;
    } break;
    case 2: {
        __HAL_RCC_TIM2_CLK_DISABLE();
        res = true;
    } break;
    case 3: {
        __HAL_RCC_TIM3_CLK_DISABLE();
        res = true;
    } break;
    case 4: {
        __HAL_RCC_TIM4_CLK_DISABLE();
        res = true;
    } break;
    case 5: {
        __HAL_RCC_TIM5_CLK_DISABLE();
        res = true;
    } break;
    case 6: {
        __HAL_RCC_TIM6_CLK_DISABLE();
        res = true;
    } break;
    case 7: {
        __HAL_RCC_TIM7_CLK_DISABLE();
        res = true;
    } break;
    case 8: {
        __HAL_RCC_TIM8_CLK_DISABLE();
        res = true;
    } break;
    case 9: {
        __HAL_RCC_TIM9_CLK_DISABLE();
        res = true;
    } break;
    case 0: {
        __HAL_RCC_TIM10_CLK_DISABLE();
        res = true;
    } break;
    case 11: {
        __HAL_RCC_TIM11_CLK_DISABLE();
        res = true;
    } break;
    case 12: {
        __HAL_RCC_TIM12_CLK_DISABLE();
        res = true;
    } break;
    case 13: {
        __HAL_RCC_TIM13_CLK_DISABLE();
        res = true;
    } break;
    case 14: {
        __HAL_RCC_TIM14_CLK_DISABLE();
        res = true;
    } break;
    default:
        res = false;
        break;
    }

    return res;
}

static bool timer_base_clock_off(const uint8_t num) {
    bool res = false;
    switch(num) {
    case 1: {
        __HAL_RCC_TIM1_CLK_ENABLE();
        res = true;
    } break;
    case 2: {
        __HAL_RCC_TIM2_CLK_ENABLE();
        res = true;
    } break;
    case 3: {
        __HAL_RCC_TIM3_CLK_ENABLE();
        res = true;
    } break;
    case 4: {
        __HAL_RCC_TIM4_CLK_ENABLE();
        res = true;
    } break;
    case 5: {
        __HAL_RCC_TIM5_CLK_ENABLE();
        res = true;
    } break;
    case 6: {
        __HAL_RCC_TIM6_CLK_ENABLE();
        res = true;
    } break;
    case 7: {
        __HAL_RCC_TIM7_CLK_ENABLE();
        res = true;
    } break;
    case 8: {
        __HAL_RCC_TIM8_CLK_ENABLE();
        res = true;
    } break;
    case 9: {
        __HAL_RCC_TIM9_CLK_ENABLE();
        res = true;
    } break;
    case 10: {
        __HAL_RCC_TIM10_CLK_ENABLE();
        res = true;
    } break;
    case 11: {
        __HAL_RCC_TIM11_CLK_ENABLE();
        res = true;
    } break;
    case 12: {
        __HAL_RCC_TIM12_CLK_ENABLE();
        res = true;
    } break;
    case 13: {
        __HAL_RCC_TIM13_CLK_ENABLE();
        res = true;
    } break;
    case 14: {
        __HAL_RCC_TIM14_CLK_ENABLE();
        res = true;
    } break;
    default:
        break;
    }

    return res;
}

bool timer_base_clock_ctrl(const uint8_t num, const bool on_off) {
    bool res = false;
    if(on_off) {
        res = timer_base_clock_on(num);
    } else {
        res = timer_base_clock_off(num);
    }
    return res;
}

void HAL_TIM_Base_MspInit(TIM_HandleTypeDef* pHandle) {
#ifdef HAS_TIMER1
    if(TIM1 == pHandle->Instance) {
        __HAL_RCC_TIM1_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM1_BRK_TIM9_IRQn, 10, 10);
        // HAL_NVIC_EnableIRQ(TIM1_BRK_TIM9_IRQn);

        HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 10, 10);
        // HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);

