aabzel/trunk/source/mcal/mcal_stm32f4/timer/timer_mcal.c
        HAL_NVIC_SetPriority(TIM1_TRG_COM_TIM11_IRQn, 10, 10);
        // HAL_NVIC_EnableIRQ(TIM1_TRG_COM_TIM11_IRQn);

        HAL_NVIC_SetPriority(TIM1_CC_IRQn, 10, 10);
        // HAL_NVIC_EnableIRQ(TIM1_CC_IRQn);
    }
#endif

#ifdef HAS_TIMER2
    if(pHandle->Instance == TIM2) {
        __HAL_RCC_TIM2_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM2_IRQn, 10, 10);
        //  HAL_NVIC_EnableIRQ(TIM2_IRQn);
    }
#endif

#ifdef HAS_TIMER3
    if(pHandle->Instance == TIM3) {
        __HAL_RCC_TIM3_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM3_IRQn, 10, 10);
        //  HAL_NVIC_EnableIRQ(TIM3_IRQn);
    }
#endif

#ifdef HAS_TIMER4
    if(pHandle->Instance == TIM4) {
        __HAL_RCC_TIM4_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM4_IRQn, 0, 0);
        //  HAL_NVIC_EnableIRQ(TIM4_IRQn);
    }
#endif

#ifdef HAS_TIMER5
    if(TIM5 == pHandle->Instance) {
        __HAL_RCC_TIM5_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM5_IRQn, 1, 1);
        //  HAL_NVIC_EnableIRQ(TIM5_IRQn);
    }
#endif

#ifdef HAS_TIMER6
    if(TIM6 == pHandle->Instance) {
        __HAL_RCC_TIM6_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM6_DAC_IRQn, 1, 1);
        //  HAL_NVIC_EnableIRQ(TIM6_DAC_IRQn);
    }
#endif

#ifdef HAS_TIMER7
    if(TIM7 == pHandle->Instance) {
        __HAL_RCC_TIM7_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM7_IRQn, 1, 1);
        // HAL_NVIC_EnableIRQ(TIM7_IRQn);
    }
#endif

#ifdef HAS_TIMER8
    if(TIM8 == pHandle->Instance) {
        __HAL_RCC_TIM8_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM8_UP_TIM13_IRQn, 1, 1);
        //  HAL_NVIC_EnableIRQ(TIM8_UP_TIM13_IRQn);

        HAL_NVIC_SetPriority(TIM8_TRG_COM_TIM14_IRQn, 1, 1);
        //  HAL_NVIC_EnableIRQ(TIM8_TRG_COM_TIM14_IRQn);

        HAL_NVIC_SetPriority(TIM8_CC_IRQn, 1, 1);
        //  HAL_NVIC_EnableIRQ(TIM8_CC_IRQn);

        HAL_NVIC_SetPriority(TIM8_BRK_TIM12_IRQn, 1, 1);
        //  HAL_NVIC_EnableIRQ(TIM8_BRK_TIM12_IRQn);
    }
#endif

#ifdef HAS_TIMER9
    if(pHandle->Instance == TIM9) {
        __HAL_RCC_TIM9_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM1_BRK_TIM9_IRQn, 10, 10);
        //   HAL_NVIC_EnableIRQ(TIM1_BRK_TIM9_IRQn);
    }
#endif

#ifdef HAS_TIMER10
    if(pHandle->Instance == TIM10) {
        __HAL_RCC_TIM10_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 10, 10);
        //   HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);
    }
#endif

#ifdef HAS_TIMER11
    if(pHandle->Instance == TIM11) {
        __HAL_RCC_TIM11_CLK_ENABLE();

        HAL_NVIC_SetPriority(TIM1_TRG_COM_TIM11_IRQn, 10, 10);
        //  HAL_NVIC_EnableIRQ(TIM1_TRG_COM_TIM11_IRQn);
    }
#endif
}

void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef* pHandle) {
#ifdef TIM1
    if(pHandle->Instance == TIM1) {
        __HAL_RCC_TIM1_CLK_DISABLE();
        HAL_NVIC_DisableIRQ(TIM1_CC_IRQn);
    }
#endif

#ifdef HAS_TIMER2
    if(pHandle->Instance == TIM2) {
        __HAL_RCC_TIM2_CLK_DISABLE();

        HAL_NVIC_DisableIRQ(TIM2_IRQn);
    }
#endif

#ifdef HAS_TIMER3
    if(pHandle->Instance == TIM3) {
        __HAL_RCC_TIM3_CLK_DISABLE();
        HAL_NVIC_DisableIRQ(TIM3_IRQn);
    }
#endif

#ifdef HAS_TIMER4
    if(pHandle->Instance == TIM4) {
        __HAL_RCC_TIM4_CLK_DISABLE();
        HAL_NVIC_DisableIRQ(TIM4_IRQn);
    }
#endif

#ifdef HAS_TIMER5
    if(pHandle->Instance == TIM5) {
        __HAL_RCC_TIM5_CLK_DISABLE();
        HAL_NVIC_DisableIRQ(TIM5_IRQn);
    }
#endif

#ifdef HAS_TIMER9
    if(pHandle->Instance == TIM9) {
        __HAL_RCC_TIM9_CLK_DISABLE();
    }
#endif

#ifdef HAS_TIMER10
    if(pHandle->Instance == TIM10) {
        __HAL_RCC_TIM10_CLK_DISABLE();
    }
#endif

#ifdef HAS_TIMER11
    if(pHandle->Instance == TIM11) {
        __HAL_RCC_TIM11_CLK_DISABLE();
    }
#endif
}
